app/controllers/home_controller.rb

INSERT INTO `offers` (`shop`, `updated_at`, `product_id`, `offer_message`, `offer_price`, `created_at`) VALUES('sportscardgirl.myshopify.com', '2010-06-29 06:52:23', 19375542, '2121', 34, '2010-06-29 06:52:23')
---
  def product
    if request.post?
       @offer=Offer.new(params[:offer])
    if @offer.save

SELECT * FROM `offers` WHERE (`offers`.`id` = 9)
---
    def review
      @offer=Offer.find params[:id]